app/Controllers/Api/LivresManuel.php

SELECT *
FROM `livres`
WHERE `livres`.`id` = '99'
---
    public function show($id)
    {
        $livre = model(LivreModel::class)->find($id);