app/Controllers/Api/v1/Livres.php

    public function index($page = 1, $par_page = 10)
    {
        // if($page < 1){
        //     $page = 1;
        // }
        // if( $par_page <= 0 ){
        //     $par_page = 10;
        // }
        $data = model(LivreModel::class)->findAll($par_page,$page);
---
SELECT *
FROM `livres`
 LIMIT 1, 10

    public function update($id = null)
    {
        $livre = $this->model->find($id);
        if(!$livre){
            return $this->failNotFound("Livre introuvable");
        }
        $data = $this->request->getJSON(true);
        if($this->request->getMethod() === 'put'){
            $data = array_merge($livre, $data);
        }
        if($this->model->update($id, $data) === false){
---
UPDATE `livres` SET `annee` = 1950
WHERE `livres`.`id` IN ('2')