app/Controllers/Api/v1/Members.php

SELECT *
FROM `members`
 LIMIT 1, 10
---
    public function index($page = 1, $par_page = 10)
    {
        $data = model(MemberModel::class)->findAll($par_page, $page);

DELETE FROM `members`
WHERE `id` IN ('1')
---
    public function delete($id = null)
    {
        $member = $this->model->find($id);
        if (!$member) {
            return $this->failNotFound("Membre introuvable");
        }
        $this->model->delete($id);